### Terraform Plan Output for `prod-team-account/alb`
```hcl
[command]/home/runner/work/_temp/83bb5dc3-c8ff-49ff-85b7-0e719ada6987/terraform-bin show -no-color tfplan.binary

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lb.alb has been deleted
  - resource "aws_lb" "alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4" -> null
      - dns_name                                    = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> null
        id                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4"
        name                                        = "cloudfence-alb"
        tags                                        = {
            "Name" = "cloudfence-alb"
        }
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.https has been deleted
  - resource "aws_lb_listener" "https" {
      - arn                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> null
        id                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda"
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.blue has been deleted
  - resource "aws_lb_target_group" "blue" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> null
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc"
        name                               = "cloudfence-blue-tg"
        tags                               = {
            "Name" = "cloudfence-blue-tg"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl.alb_waf has been deleted
  - resource "aws_wafv2_web_acl" "alb_waf" {
      - arn           = "arn:aws:wafv2:ap-northeast-2:243359234795:regional/webacl/cloudfence-alb-waf/ef46bd94-2986-4baa-b706-adc6e3584106" -> null
        id            = "ef46bd94-2986-4baa-b706-adc6e3584106"
        name          = "cloudfence-alb-waf"
        tags          = {
            "Name" = "cloudfence-alb-waf"
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "cloudfence-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0901c74dad6dc2648",
        ]
      + subnets                                                      = [
          + "subnet-0c5f26bf8ae501ff0",
          + "subnet-0df2871a859b233cd",
        ]
      + tags                                                         = {
          + "Name" = "cloudfence-alb"
        }
      + tags_all                                                     = {
          + "Name" = "cloudfence-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:243359234795:certificate/c1771cc4-e706-48af-8478-d5ad0703a5ee"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.https_redirect will be created
  + resource "aws_lb_listener" "https_redirect" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_target_group.blue will be created
  + resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "cloudfence-blue-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "cloudfence-blue-tg"
        }
      + tags_all                           = {
          + "Name" = "cloudfence-blue-tg"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group.green will be created
  + resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "cloudfence-green-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "cloudfence-green-tg"
        }
      + tags_all                           = {
          + "Name" = "cloudfence-green-tg"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_wafv2_web_acl.alb_waf will be created
  + resource "aws_wafv2_web_acl" "alb_waf" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF for ALB"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "cloudfence-alb-waf"
      + name_prefix                 = (known after apply)
      + scope                       = "REGIONAL"
      + tags                        = {
          + "Name" = "cloudfence-alb-waf"
        }
      + tags_all                    = {
          + "Name" = "cloudfence-alb-waf"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "waf-alb-metric"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.alb_association will be created
  + resource "aws_wafv2_web_acl_association" "alb_association" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ blue_target_group_arn   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> (known after apply)
  ~ dns_name                = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> (known after apply)
  ~ listener_arn            = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_lb.alb has been deleted%0A  - resource "aws_lb" "alb" {%0A      - arn                                         = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4" -> null%0A      - dns_name                                    = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> null%0A        id                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4"%0A        name                                        = "cloudfence-alb"%0A        tags                                        = {%0A            "Name" = "cloudfence-alb"%0A        }%0A        # (22 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_listener.https has been deleted%0A  - resource "aws_lb_listener" "https" {%0A      - arn                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> null%0A        id                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda"%0A        # (7 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_target_group.blue has been deleted%0A  - resource "aws_lb_target_group" "blue" {%0A      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> null%0A        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc"%0A        name                               = "cloudfence-blue-tg"%0A        tags                               = {%0A            "Name" = "cloudfence-blue-tg"%0A        }%0A        # (16 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_wafv2_web_acl.alb_waf has been deleted%0A  - resource "aws_wafv2_web_acl" "alb_waf" {%0A      - arn           = "arn:aws:wafv2:ap-northeast-2:243359234795:regional/webacl/cloudfence-alb-waf/ef46bd94-2986-4baa-b706-adc6e3584106" -> null%0A        id            = "ef46bd94-2986-4baa-b706-adc6e3584106"%0A        name          = "cloudfence-alb-waf"%0A        tags          = {%0A            "Name" = "cloudfence-alb-waf"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = true%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "cloudfence-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-0901c74dad6dc2648",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-0c5f26bf8ae501ff0",%0A          + "subnet-0df2871a859b233cd",%0A        ]%0A      + tags                                                         = {%0A          + "Name" = "cloudfence-alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name" = "cloudfence-alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A    }%0A%0A  # aws_lb_listener.https will be created%0A  + resource "aws_lb_listener" "https" {%0A      + arn                                                                   = (known after apply)%0A      + certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:243359234795:certificate/c1771cc4-e706-48af-8478-d5ad0703a5ee"%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 443%0A      + protocol                                                              = "HTTPS"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_lb_listener.https_redirect will be created%0A  + resource "aws_lb_listener" "https_redirect" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.blue will be created%0A  + resource "aws_lb_target_group" "blue" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "cloudfence-blue-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name" = "cloudfence-blue-tg"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "cloudfence-blue-tg"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A    }%0A%0A  # aws_lb_target_group.green will be created%0A  + resource "aws_lb_target_group" "green" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "cloudfence-green-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name" = "cloudfence-green-tg"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "cloudfence-green-tg"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A    }%0A%0A  # aws_wafv2_web_acl.alb_waf will be created%0A  + resource "aws_wafv2_web_acl" "alb_waf" {%0A      + application_integration_url = (known after apply)%0A      + arn                         = (known after apply)%0A      + capacity                    = (known after apply)%0A      + description                 = "WAF for ALB"%0A      + id                          = (known after apply)%0A      + lock_token                  = (known after apply)%0A      + name                        = "cloudfence-alb-waf"%0A      + name_prefix                 = (known after apply)%0A      + scope                       = "REGIONAL"%0A      + tags                        = {%0A          + "Name" = "cloudfence-alb-waf"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "cloudfence-alb-waf"%0A        }%0A%0A      + default_action {%0A          + allow {%0A            }%0A        }%0A%0A      + rule {%0A          + name     = "AWS-AWSManagedRulesCommonRuleSet"%0A          + priority = 1%0A%0A          + override_action {%0A              + none {}%0A            }%0A%0A          + statement {%0A              + managed_rule_group_statement {%0A                  + name        = "AWSManagedRulesCommonRuleSet"%0A                  + vendor_name = "AWS"%0A                }%0A            }%0A%0A          + visibility_config {%0A              + cloudwatch_metrics_enabled = true%0A              + metric_name                = "AWSManagedRulesCommonRuleSet"%0A              + sampled_requests_enabled   = true%0A            }%0A        }%0A%0A      + visibility_config {%0A          + cloudwatch_metrics_enabled = true%0A          + metric_name                = "waf-alb-metric"%0A          + sampled_requests_enabled   = true%0A        }%0A    }%0A%0A  # aws_wafv2_web_acl_association.alb_association will be created%0A  + resource "aws_wafv2_web_acl_association" "alb_association" {%0A      + id           = (known after apply)%0A      + resource_arn = (known after apply)%0A      + web_acl_arn  = (known after apply)%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ blue_target_group_arn   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> (known after apply)%0A  ~ dns_name                = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> (known after apply)%0A  ~ listener_arn            = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # aws_lb.alb has been deleted%0A  - resource "aws_lb" "alb" {%0A      - arn                                         = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4" -> null%0A      - dns_name                                    = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> null%0A        id                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:loadbalancer/app/cloudfence-alb/f47e0f7ae8cca8d4"%0A        name                                        = "cloudfence-alb"%0A        tags                                        = {%0A            "Name" = "cloudfence-alb"%0A        }%0A        # (22 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_listener.https has been deleted%0A  - resource "aws_lb_listener" "https" {%0A      - arn                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> null%0A        id                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda"%0A        # (7 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_target_group.blue has been deleted%0A  - resource "aws_lb_target_group" "blue" {%0A      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> null%0A        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc"%0A        name                               = "cloudfence-blue-tg"%0A        tags                               = {%0A            "Name" = "cloudfence-blue-tg"%0A        }%0A        # (16 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_wafv2_web_acl.alb_waf has been deleted%0A  - resource "aws_wafv2_web_acl" "alb_waf" {%0A      - arn           = "arn:aws:wafv2:ap-northeast-2:243359234795:regional/webacl/cloudfence-alb-waf/ef46bd94-2986-4baa-b706-adc6e3584106" -> null%0A        id            = "ef46bd94-2986-4baa-b706-adc6e3584106"%0A        name          = "cloudfence-alb-waf"%0A        tags          = {%0A            "Name" = "cloudfence-alb-waf"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lb.alb will be created%0A  + resource "aws_lb" "alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = true%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "cloudfence-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-0901c74dad6dc2648",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-0c5f26bf8ae501ff0",%0A          + "subnet-0df2871a859b233cd",%0A        ]%0A      + tags                                                         = {%0A          + "Name" = "cloudfence-alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name" = "cloudfence-alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A    }%0A%0A  # aws_lb_listener.https will be created%0A  + resource "aws_lb_listener" "https" {%0A      + arn                                                                   = (known after apply)%0A      + certificate_arn                                                       = "arn:aws:acm:ap-northeast-2:243359234795:certificate/c1771cc4-e706-48af-8478-d5ad0703a5ee"%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 443%0A      + protocol                                                              = "HTTPS"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_lb_listener.https_redirect will be created%0A  + resource "aws_lb_listener" "https_redirect" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_lb_target_group.blue will be created%0A  + resource "aws_lb_target_group" "blue" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "cloudfence-blue-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name" = "cloudfence-blue-tg"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "cloudfence-blue-tg"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A    }%0A%0A  # aws_lb_target_group.green will be created%0A  + resource "aws_lb_target_group" "green" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "cloudfence-green-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name" = "cloudfence-green-tg"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "cloudfence-green-tg"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0bdd444c9fd4a19ef"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = (known after apply)%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A    }%0A%0A  # aws_wafv2_web_acl.alb_waf will be created%0A  + resource "aws_wafv2_web_acl" "alb_waf" {%0A      + application_integration_url = (known after apply)%0A      + arn                         = (known after apply)%0A      + capacity                    = (known after apply)%0A      + description                 = "WAF for ALB"%0A      + id                          = (known after apply)%0A      + lock_token                  = (known after apply)%0A      + name                        = "cloudfence-alb-waf"%0A      + name_prefix                 = (known after apply)%0A      + scope                       = "REGIONAL"%0A      + tags                        = {%0A          + "Name" = "cloudfence-alb-waf"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "cloudfence-alb-waf"%0A        }%0A%0A      + default_action {%0A          + allow {%0A            }%0A        }%0A%0A      + rule {%0A          + name     = "AWS-AWSManagedRulesCommonRuleSet"%0A          + priority = 1%0A%0A          + override_action {%0A              + none {}%0A            }%0A%0A          + statement {%0A              + managed_rule_group_statement {%0A                  + name        = "AWSManagedRulesCommonRuleSet"%0A                  + vendor_name = "AWS"%0A                }%0A            }%0A%0A          + visibility_config {%0A              + cloudwatch_metrics_enabled = true%0A              + metric_name                = "AWSManagedRulesCommonRuleSet"%0A              + sampled_requests_enabled   = true%0A            }%0A        }%0A%0A      + visibility_config {%0A          + cloudwatch_metrics_enabled = true%0A          + metric_name                = "waf-alb-metric"%0A          + sampled_requests_enabled   = true%0A        }%0A    }%0A%0A  # aws_wafv2_web_acl_association.alb_association will be created%0A  + resource "aws_wafv2_web_acl_association" "alb_association" {%0A      + id           = (known after apply)%0A      + resource_arn = (known after apply)%0A      + web_acl_arn  = (known after apply)%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ blue_target_group_arn   = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:targetgroup/cloudfence-blue-tg/e32c1812a58c2ecc" -> (known after apply)%0A  ~ dns_name                = "cloudfence-alb-837737541.ap-northeast-2.elb.amazonaws.com" -> (known after apply)%0A  ~ listener_arn            = "arn:aws:elasticloadbalancing:ap-northeast-2:243359234795:listener/app/cloudfence-alb/f47e0f7ae8cca8d4/63a27fd938e3acda" -> (known after apply)%0A

::set-output name=stderr::

::set-output name=exitcode::0
```